Documents/Ведомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Ведомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВедомостьДоговоров</xr:Item>
				<xr:Item>AccumulationRegister.СимволыВедомости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Литеры</Name>
					<Comment>Строковые символы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорыСтрокой</Name>
					<Comment>Перечень ГУИД ссылок справочника договоры (разделитель";")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорыТаблицей</Name>
					<Comment>Таблица значений с колонкой из ссылок справочника  договоры</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь создавший документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ВедомостьДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВедомостьДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Ведомость/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныхПроцедурДляКомандДокумента

Процедура Печать(ТабДок, СсылкиВедомостей) Экспорт
	
	ОснвнПараметр = Новый Структура("СсылкиДоговоров, ОбластьТабличногоДокумента, КолвоДоговоровТаблицы");
	ДопПараметры = Новый Структура("УникальныеДоговорыДокумента, ДатыОкончанияДоговоров, КонтрольОриентацииЛиста");
	ДатыОкончанияДоговоров = Новый Соответствие;
	УникальныеДоговорыДокумента = Новый Соответствие;
	ОриентацияЛистаПриПечати = Новый Соответствие;
	
	Макет = Документы.Ведомость.ПолучитьМакет("ПФ_Договоры");
	
	ОбластьДоговорыШапкаНач = Макет.ПолучитьОбласть("ДоговорыШапка|Верх");
	ОбластьДоговорыНач = Макет.ПолучитьОбласть("Договоры|Верх");
	
	ОбластьДоговорыШапкаТЧ = Макет.ПолучитьОбласть("ДоговорыШапка|ДоговорыШапкаВерх");
	ОбластьДоговорыШапкаРС = Макет.ПолучитьОбласть("ДоговорыШапка|ДоговорыШапкаВерх");
	ОбластьДоговорыШапкаХЗ = Макет.ПолучитьОбласть("ДоговорыШапка|ДоговорыШапкаВерх");
	ОбластьДоговорыШапкаСтр = Макет.ПолучитьОбласть("ДоговорыШапка|ДоговорыШапкаВерх");
	
	ОбластьДоговорыТЧ = Макет.ПолучитьОбласть("Договоры|ДоговорыВерх");
	ОбластьДоговорыРС = Макет.ПолучитьОбласть("Договоры|ДоговорыВерх");
	ОбластьДоговорыХЗ = Макет.ПолучитьОбласть("Договоры|ДоговорыВерх");
	ОбластьДоговорыСтр = Макет.ПолучитьОбласть("Договоры|ДоговорыВерх");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	СсылкиДоговоровДляПечати = ПолучитьДоговорыДокумента(СсылкиВедомостей);
	ДоговорыТабличнойЧасти = СсылкиДоговоровДляПечати["ДоговорыТабличнойЧасти"];
	ДоговорыРегистраСведений = СсылкиДоговоровДляПечати["ДоговорыРегистраСведений"];
	ДоговорыХранилищаЗначений = СсылкиДоговоровДляПечати["ДоговорыХранилищаЗначений"];
	ДоговорыИзСтроки = СсылкиДоговоровДляПечати["ДоговорыСтроки"];
	РеквизитыДокумента = СсылкиДоговоровДляПечати["РеквизитыВедомостей"];
	
	ВставлятьРазделительСтраниц = Ложь;
	Для каждого Ведомость Из СсылкиВедомостей Цикл
		
		ДатыОкончанияДоговоров.Очистить();
		УникальныеДоговорыДокумента.Очистить();
		
		КолвоДоговоровВТабЧасти =
			?(ДоговорыТабличнойЧасти.Количество() = 0 ИЛИ ДоговорыРегистраСведений[Ведомость] = Неопределено, 0, ДоговорыТабличнойЧасти[Ведомость].Количество());
		КолвоДоговоровВРегСведений = 
			?(ДоговорыРегистраСведений.Количество() = 0 ИЛИ ДоговорыРегистраСведений[Ведомость] = Неопределено, 0, ДоговорыРегистраСведений[Ведомость].Количество());
		КолвоДоговоровВХранилища =
			?(ДоговорыХранилищаЗначений.Количество() = 0 ИЛИ ДоговорыХранилищаЗначений[Ведомость] = Неопределено, 0, ДоговорыХранилищаЗначений[Ведомость].Количество());
		КолвоДоговоровВСтроке = 
			?(ДоговорыИзСтроки.Количество() = 0 ИЛИ ДоговорыИзСтроки[Ведомость] = Неопределено, 0, ДоговорыИзСтроки[Ведомость].Количество());
			
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если РеквизитыДокумента.Получить(Ведомость) <> Неопределено Тогда
			ОбластьШапка.Параметры.Номер = РеквизитыДокумента[Ведомость].Номер;
			ОбластьШапка.Параметры.Дата = Формат(РеквизитыДокумента[Ведомость].Дата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьДоговорыШапкаНач);
		
		Если КолвоДоговоровВТабЧасти <> 0 Тогда
			ОбластьДоговорыШапкаТЧ.Параметры.ТипХранилища = ДоговорыТабличнойЧасти["ТипХранилища"];
			ТабДок.Присоединить(ОбластьДоговорыШапкаТЧ);			
		КонецЕсли;
		
		Если КолвоДоговоровВРегСведений <> 0 Тогда
			ОбластьДоговорыШапкаРС.Параметры.ТипХранилища = ДоговорыРегистраСведений["ТипХранилища"];
			ТабДок.Присоединить(ОбластьДоговорыШапкаРС);			
		КонецЕсли;
		
		Если КолвоДоговоровВХранилища <> 0 Тогда
			ОбластьДоговорыШапкаХЗ.Параметры.ТипХранилища = ДоговорыХранилищаЗначений["ТипХранилища"];
			ТабДок.Присоединить(ОбластьДоговорыШапкаХЗ);
		КонецЕсли;
		
		Если КолвоДоговоровВСтроке <> 0 Тогда
			ОбластьДоговорыШапкаСтр.Параметры.ТипХранилища = ДоговорыИзСтроки["ТипХранилища"];
			ТабДок.Присоединить(ОбластьДоговорыШапкаСтр);
		КонецЕсли;
		
		МаксимальноеЗначение = МаксимальноеКоличествоДоговоровДокумента(
			КолвоДоговоровВТабЧасти, КолвоДоговоровВРегСведений, КолвоДоговоровВХранилища, КолвоДоговоровВСтроке);
			
		Если МаксимальноеЗначение = 0 Тогда Продолжить; КонецЕсли;
		
		Если МаксимальноеЗначение <> 0 Тогда
			   
			Для Индекс = 0 По МаксимальноеЗначение - 1  Цикл 
				
				ТабДок.Вывести(ОбластьДоговорыНач);
				
				ОснвнПараметр.ОбластьТабличногоДокумента = ОбластьДоговорыТЧ;
				ОснвнПараметр.КолвоДоговоровТаблицы = КолвоДоговоровВТабЧасти;
				ОснвнПараметр.СсылкиДоговоров = ДоговорыТабличнойЧасти;
				ДопПараметры.УникальныеДоговорыДокумента = УникальныеДоговорыДокумента;
				ДопПараметры.ДатыОкончанияДоговоров = ДатыОкончанияДоговоров;
				ДопПараметры.КонтрольОриентацииЛиста = ОриентацияЛистаПриПечати;
				
				НаполнениеМакетаДаннымиДоговоров(Индекс, ТабДок, Ведомость, ОснвнПараметр, ДопПараметры);
				
				ОснвнПараметр.ОбластьТабличногоДокумента = ОбластьДоговорыРС;
				ОснвнПараметр.КолвоДоговоровТаблицы = КолвоДоговоровВРегСведений;
				ОснвнПараметр.СсылкиДоговоров = ДоговорыРегистраСведений;
				ДопПараметры.УникальныеДоговорыДокумента = УникальныеДоговорыДокумента;
				ДопПараметры.ДатыОкончанияДоговоров = ДатыОкончанияДоговоров;
				ДопПараметры.КонтрольОриентацииЛиста = ОриентацияЛистаПриПечати;
				
				НаполнениеМакетаДаннымиДоговоров(Индекс, ТабДок, Ведомость, ОснвнПараметр, ДопПараметры);
		
				ОснвнПараметр.ОбластьТабличногоДокумента = ОбластьДоговорыХЗ;
				ОснвнПараметр.КолвоДоговоровТаблицы = КолвоДоговоровВХранилища;
				ОснвнПараметр.СсылкиДоговоров = ДоговорыХранилищаЗначений;
				ДопПараметры.УникальныеДоговорыДокумента = УникальныеДоговорыДокумента;
				ДопПараметры.ДатыОкончанияДоговоров = ДатыОкончанияДоговоров;
				ДопПараметры.КонтрольОриентацииЛиста = ОриентацияЛистаПриПечати;
				
				НаполнениеМакетаДаннымиДоговоров(Индекс, ТабДок, Ведомость, ОснвнПараметр, ДопПараметры);
				
				ОснвнПараметр.ОбластьТабличногоДокумента = ОбластьДоговорыСтр;
				ОснвнПараметр.КолвоДоговоровТаблицы = КолвоДоговоровВСтроке;
				ОснвнПараметр.СсылкиДоговоров = ДоговорыИзСтроки;
				ДопПараметры.УникальныеДоговорыДокумента = УникальныеДоговорыДокумента;
				ДопПараметры.ДатыОкончанияДоговоров = ДатыОкончанияДоговоров;
				ДопПараметры.КонтрольОриентацииЛиста = ОриентацияЛистаПриПечати;
				
				НаполнениеМакетаДаннымиДоговоров(Индекс, ТабДок, Ведомость, ОснвнПараметр, ДопПараметры);
	
			КонецЦикла;
			
			ПоздниеДоговора = ПоздниеОкончанияДоговоров(ДатыОкончанияДоговоров);
			
			ОбластьПодвал.Параметры.ВсегоРазличных = УникальныеДоговорыДокумента.Количество();
			ОбластьПодвал.Параметры.Действующие = КоличествоАктивныхДоговороы(УникальныеДоговорыДокумента);
			ОбластьПодвал.Параметры.ПоздниеДоговора = ПоздниеДоговора.Договоры  + " (" + ПоздниеДоговора.Дата +")";
			
			Иначе
				
			ОбластьПодвал.Параметры.ВсегоРазличных = 0;
			ОбластьПодвал.Параметры.Действующие = 0;
			ОбластьПодвал.Параметры.ПоздниеДоговора = 0;
			
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьПодвал);
		
		ВставлятьРазделительСтраниц = Истина;
		
		МассивОбластейТабДок = Новый Массив;
		МассивОбластейТабДок.Добавить(ОбластьДоговорыШапкаНач);
		МассивОбластейТабДок.Добавить(ОбластьДоговорыНач);
		МассивОбластейТабДок.Добавить(ОбластьДоговорыШапкаТЧ);
		МассивОбластейТабДок.Добавить(ОбластьДоговорыШапкаРС);
		МассивОбластейТабДок.Добавить(ОбластьДоговорыШапкаХЗ);
		МассивОбластейТабДок.Добавить(ОбластьДоговорыШапкаСтр);
		МассивОбластейТабДок.Добавить(ОбластьДоговорыТЧ);
		МассивОбластейТабДок.Добавить(ОбластьДоговорыРС);
		МассивОбластейТабДок.Добавить(ОбластьДоговорыХЗ);
		МассивОбластейТабДок.Добавить(ОбластьДоговорыСтр);
		МассивОбластейТабДок.Добавить(ОбластьШапка);
		МассивОбластейТабДок.Добавить(ОбластьПодвал);
		
		НастройкиДляПечати(МассивОбластейТабДок, ТабДок, ОриентацияЛистаПриПечати, РеквизитыДокумента[Ведомость].Номер);

	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьИОтправитьСообщениеПочтой(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.Ведомость.ПолучитьМакет("ПФ_Почта");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Представление КАК Договор,
		|	Договоры.Активен КАК Активен
		|ИЗ
		|	Документ.Ведомость.Договоры КАК ВедомостьДоговоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|		ПО ВедомостьДоговоры.Договор = Договоры.Ссылка
		|ГДЕ
		|	ВедомостьДоговоры.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
		|	Ведомость.Представление КАК Документ,
		|	Пользователи.Представление КАК Менеджер
		|ИЗ
		|	Документ.Ведомость КАК Ведомость
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Ведомость.Менеджер = Пользователи.Ссылка
		|ГДЕ
		|	Ведомость.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() Тогда
		
		Текст = НСтр("ru = 'Договоры записанные в документе отствуют в справочнике.
		           					|Отправка письма на почтовый ящик не возможна.'");
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
		Возврат;
		
	Иначе
		ВыборкаДоговоры = РезультатЗапроса[0].Выбрать();	
	КонецЕсли;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДоговорыШапка = Макет.ПолучитьОбласть("ДоговорыШапка");
	ОбластьПросроченныеДоговоры = Макет.ПолучитьОбласть("Договоры");
	ОбластьАктивныеДоговоры = Макет.ПолучитьОбласть("ДоговорыА");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Выборка.Следующий(); 
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
	АдресПочтовогоЯщика = ПользовательИБ.АдресЭлектроннойПочты;
	
	Если АдресПочтовогоЯщика = "" Тогда
		
		Текст = "Адрес электронной почты менеджера (пользователя) незаполнен."+ Символы.ПС +
			"Отправка письма на почтовый ящик не возможна.";	
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
		Возврат;
		
	КонецЕсли;
	
	Если ВставлятьРазделительСтраниц Тогда
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Шапка.Параметры.Заполнить(Выборка);
	
	ТабДок.Вывести(Шапка, Выборка.Уровень());
	ТабДок.Вывести(ОбластьДоговорыШапка);
	
	Пока ВыборкаДоговоры.Следующий() Цикл 
				
		Если ВыборкаДоговоры.Активен Тогда	
			ОбластьАктивныеДоговоры.Параметры.Заполнить(ВыборкаДоговоры);
			ОбластьОформления = ТабДок.Вывести(ОбластьАктивныеДоговоры, ВыборкаДоговоры.Уровень());
		Иначе
			ОбластьПросроченныеДоговоры.Параметры.Заполнить(ВыборкаДоговоры);
			ОбластьОформления = ТабДок.Вывести(ОбластьПросроченныеДоговоры, ВыборкаДоговоры.Уровень());	
		КонецЕсли;
		
	КонецЦикла;
	
	Подвал.Параметры.Заполнить(Выборка);
	ТабДок.Вывести(Подвал);
	
	ВставлятьРазделительСтраниц = Истина;
	
	ОтправитьПисьмоНаПочтовыйАдрес(Ссылка, Выборка.Документ, ТабДок, АдресПочтовогоЯщика)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Отправка готового письма на почтовый адрес пользователя.
//
// Параметры:
//  Ссылка  - ДокументСсылка.Ведомость - ссылка на текущий документ
// 
//  Документ  - Строка - представление текущего документа
//
//  Таблица  - ТабличныйДокумент - табличная часть текущего документа
// 
//  Адрес  - Строка - почтовый адрес на который идет отправления письма
//
Процедура ОтправитьПисьмоНаПочтовыйАдрес(Ссылка, Документ, Таблица, Адрес)
	
	Попытка
		
		РаботаСПочтовымиСообщениями.ОтправитьПисьмо(
			Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, 
			ПочтовоеСообщение(Таблица, Адрес));
		
	Исключение
		
		Информация = СтрШаблон(
			"В документе '%1' ошибка отправки письма на почтовый ящик по адресу '%2'.", Документ, Адрес);
		
		ОбщегоНазначения.СообщитьПользователю(Информация);
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Отправка письма.'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.Ведомость, Ссылка,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;	
	
КонецПроцедуры

// Возвращает договоры для печати выбранных документов.
//
// Параметры:
//  Ссылка  - Массив - состоит из ссылок типа 'ДокуметСсылка.Ведомость'.
//
// Возвращаемое значение:
//   Структура   - коллекция соответствий по типам хранения договоров и реквизитов документов.
//
Функция ПолучитьДоговорыДокумента(СсылкиВедомостей)
	
	ДоговорыВедомостейПоТипамХраниния = Новый Структура();
	УникальныеДоговорыВедомостей = Новый Соответствие;
	РеквизитыВедомостей = Новый Соответствие;
	
	ДоговорыТабличнойЧасти = Новый Соответствие;
	ДоговорыТабличнойЧасти.Вставить("ТипХранилища", "Договоры из табличной части");

	ДоговорыРегистраСведений = Новый Соответствие;
	ДоговорыРегистраСведений.Вставить("ТипХранилища", "Договоры из регистра сведений");

	ДоговорыХранилищаЗначений = Новый Соответствие;
	ДоговорыХранилищаЗначений.Вставить("ТипХранилища", "Договоры из хранилища значений");

	ДоговорыСтроки = Новый Соответствие;
	ДоговорыСтроки.Вставить("ТипХранилища", "Договоры из строки");
			
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьДоговоров.Договор КАК ДоговорРегистра,
	|	ВедомостьДоговоры.Договор КАК ДоговорТабличнойЧасти,
	|	Ведомость.Номер КАК Номер,
	|	Ведомость.Дата КАК Дата,
	|	Ведомость.ДоговорыСтрокой КАК ДоговорыСтрокой,
	|	Ведомость.ДоговорыТаблицей КАК ДоговорыТаблицей,
	|	Ведомость.Ссылка КАК Ведомость
	|ИЗ
	|	Документ.Ведомость КАК Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВедомостьДоговоров КАК ВедомостьДоговоров
	|		ПО (ВедомостьДоговоров.Регистратор = Ведомость.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Ведомость.Договоры КАК ВедомостьДоговоры
	|		ПО ВедомостьДоговоры.Ссылка = Ведомость.Ссылка
	|ГДЕ
	|	Ведомость.Ссылка В (&СсылкиВедомостей)";
	
	Запрос.Параметры.Вставить("СсылкиВедомостей", СсылкиВедомостей);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Ведомость Из СсылкиВедомостей Цикл
		Выборка.Сбросить();
		
		ТабЗначРегистров = Новый ТаблицаЗначений;
		ТабЗначРегистров.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.Договоры"));
		ТабЗначТабЧасти = Новый ТаблицаЗначений;
		ТабЗначТабЧасти.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.Договоры"));
		
		Пока Выборка.Следующий() Цикл	
			РеквизитыДокумента = Новый Структура("Номер, Дата, АктивныеДоговоры, ВсегоДоговоров", Выборка.Номер, Выборка.Дата, 0, 0);
			
			Если Выборка.Ведомость = Ведомость Тогда
				
				НовСтр = ТабЗначРегистров.Добавить();
				НовСтр.Договор = Выборка.ДоговорРегистра;
				
				НовСтр = ТабЗначТабЧасти.Добавить();
				НовСтр.Договор = Выборка.ДоговорТабличнойЧасти;
				
				УникальныеДоговорыВедомостей.Вставить(Выборка.ДоговорТабличнойЧасти);
				УникальныеДоговорыВедомостей.Вставить(Выборка.ДоговорРегистра);
				
			КонецЕсли; 
			
			Если ДоговорыХранилищаЗначений.Получить(Ведомость) = Неопределено И Выборка.Ведомость = Ведомость Тогда
				ДоговорыХранилищаЗначений.Вставить(Ведомость, ВедомостьСервер.КоллекцияДоговоровИзХранилица(Выборка));
				
				Для Каждого СтрокаТЗ Из ДоговорыХранилищаЗначений[Ведомость] Цикл
					УникальныеДоговорыВедомостей.Вставить(СтрокаТЗ.Договор);
				КонецЦикла;
				
			КонецЕсли;
			
			Если ДоговорыСтроки.Получить(Ведомость) = Неопределено И Выборка.Ведомость = Ведомость Тогда
				
				ДоговорыСтроки.Вставить(Ведомость, ВедомостьСервер.КоллекцияДоговоровИзСтроки(Выборка.ДоговорыСтрокой));
				
				Для Каждого Колонка Из ДоговорыСтроки[Ведомость] Цикл
					УникальныеДоговорыВедомостей.Вставить(Колонка.Договор);
				КонецЦикла;
				
			КонецЕсли;
			
			Если РеквизитыВедомостей.Получить(Ведомость) = Неопределено И Выборка.Ведомость = Ведомость Тогда
				РеквизитыВедомостей.Вставить(Ведомость, РеквизитыДокумента);
			КонецЕсли;
			
		КонецЦикла;
		
		ДоговорыТабличнойЧасти.Вставить(Ведомость, ТабЗначТабЧасти);
		ДоговорыРегистраСведений.Вставить(Ведомость, ТабЗначРегистров);

	КонецЦикла;
	
	УникальныеСсылкиДоговоров = Новый Массив;
	Для Каждого Элемент Из УникальныеДоговорыВедомостей Цикл
		УникальныеСсылкиДоговоров.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК ДоговорСсылка,
	|	Договоры.Наименование КАК Договор,
	|	Договоры.Активен КАК Активен,
	|	Договоры.НачалоДействия КАК НачалоДействия,
	|	Договоры.ОкончаниеДействия КАК ОкончаниеДействия
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Договоры)";
	
	Запрос.УстановитьПараметр("Договоры", УникальныеСсылкиДоговоров);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнениеДаннымиДоговоровДляПечати(Выборка, ДоговорыРегистраСведений, СсылкиВедомостей);
	ЗаполнениеДаннымиДоговоровДляПечати(Выборка, ДоговорыТабличнойЧасти, СсылкиВедомостей);
	ЗаполнениеДаннымиДоговоровДляПечати(Выборка, ДоговорыХранилищаЗначений, СсылкиВедомостей);
	ЗаполнениеДаннымиДоговоровДляПечати(Выборка, ДоговорыСтроки, СсылкиВедомостей);
	
	ДоговорыВедомостейПоТипамХраниния.Вставить("ДоговорыТабличнойЧасти", ДоговорыТабличнойЧасти);
	ДоговорыВедомостейПоТипамХраниния.Вставить("ДоговорыРегистраСведений", ДоговорыРегистраСведений);
	ДоговорыВедомостейПоТипамХраниния.Вставить("ДоговорыХранилищаЗначений", ДоговорыХранилищаЗначений);
	ДоговорыВедомостейПоТипамХраниния.Вставить("ДоговорыСтроки", ДоговорыСтроки);
	ДоговорыВедомостейПоТипамХраниния.Вставить("РеквизитыВедомостей", РеквизитыВедомостей);
	
	Возврат ДоговорыВедомостейПоТипамХраниния;
	
КонецФункции

// Заполнение данными табличных частей макета печати.
//
// Параметры:
//  УказательСтрокиТЗ  - Число - указатель на строку таблицы значений с данными договора от индекса цикла формирования табличной 
//                   части макета для печати.
//  ТабДок  - ТабличныйДокумент - печатная форма документа.
//  Ведомость  - ДокуметСсылка.Ведомость - документ выбранный для печати.
//  ОснвнПараметры  - Структура("СсылкиДоговоров, ОбластьТабличногоДокумента, КолвоДоговоровТаблицы") - в параметр входят: 
//                 область размещения табличной части договоров, количество договоров табличной части, договоры табличной части.
//  ДопПараметры  - Структура - в параметр входят: данные для подсчета активных договоров, данные для определения самой большой
//                 даты окончания договоров, данные для настройки печати.
//  
Процедура НаполнениеМакетаДаннымиДоговоров(УказательСтрокиТЗ, ТабДок, Ведомость, ОснвнПараметры, ДопПараметры)
		
	Если ОснвнПараметры.КолвоДоговоровТаблицы > УказательСтрокиТЗ И ОснвнПараметры.КолвоДоговоровТаблицы <> 0 Тогда
		
		СтрокаТабЗначДоговора = ОснвнПараметры.СсылкиДоговоров[Ведомость][УказательСтрокиТЗ];
		МакетТабДок = ОснвнПараметры.ОбластьТабличногоДокумента;
		
		ДопПараметры.ДатыОкончанияДоговоров.Вставить(СтрокаТабЗначДоговора.Договор, СтрокаТабЗначДоговора.ОкончаниеДействия);
		ДопПараметры.УникальныеДоговорыДокумента.Вставить(СтрокаТабЗначДоговора.Договор, СтрокаТабЗначДоговора.Активен);
		ДопПараметры.КонтрольОриентацииЛиста.Вставить(ОснвнПараметры.КолвоДоговоровТаблицы);
		
		МакетТабДок.Параметры.Договор = СтрокаТабЗначДоговора.Договор;
		МакетТабДок.Параметры.Активен = Формат(СтрокаТабЗначДоговора.Активен, "БЛ=Нет; БИ=Да");
		МакетТабДок.Параметры.РазностьДат = ОбщегоНазначенияСлужебныйСервер.ФорматированноеПолучениеРазницыДат(
			СтрокаТабЗначДоговора.НачалоДействия, СтрокаТабЗначДоговора.ОкончаниеДействия);
		
		ТабДок.Присоединить(МакетТабДок);
		
	ИначеЕсли  ОснвнПараметры.КолвоДоговоровТаблицы <> 0 Тогда 
		
		ТабДок.Область(ТабДок.Присоединить(ОснвнПараметры.ОбластьТабличногоДокумента).Имя).Очистить( , Истина, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Настройки ориентации листа при печати.
//
// Параметры:
//  ОбластиТабличногоДокумента  - Массив - области макета табличного документа, учавствующие в формировании печатной формы.
//  ТабДок  - ТабличныйДокумент - печатная форма документа.
//  ЗаполненныеТаблЧастиМакета  - Соответствие - количество заполненных табличных частей макета табличного документа полученных для печати.
//  НомерДокумента  - Строка - номер реквизита документа
//
Процедура НастройкиДляПечати(ОбластиТабличногоДокумента, ТабДок, ЗаполненныеТаблЧастиМакета, НомерДокумента)
	
	ТабДок.Автомасштаб = Истина;
		
	ТабДок.ОриентацияСтраницы =
		?(ЗаполненныеТаблЧастиМакета.Количество() <= 2, ОриентацияСтраницы.Портрет, ОриентацияСтраницы.Ландшафт);

	Если Не ТабДок.ПроверитьВывод(ОбластиТабличногоДокумента) Тогда 
		ШрифтКолонтитула = Новый Шрифт("Arial", 8, Истина);
		ТабДок.ВерхнийКолонтитул.Шрифт = ШрифтКолонтитула;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДок.ВерхнийКолонтитул.Выводить = Истина;
		ТабДок.РазмерКолонтитулаСверху = 7;
		ТабДок.ВерхнийКолонтитул.НачальнаяСтраница = 2;
		ТабДок.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ТабДок.ВерхнийКолонтитул.ТекстСлева = СтрШаблон("№%1", НомерДокумента);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет коллекции по типам хранения данными договоров из табличных частей документа.
//
// Параметры:
//  КоллекцияДанныхДоговоров  - Выборка - результат выполнения запроса, содержит коллекцию договоров для печати.
//  ТипХраненияДоговоров  - Соответствие - коллекция значений для хранения данных договоров  по типам хранения в документе
//              где ссылка на документ является ключом.
//  СсылкиВедомостей  - ссылки документов выбранных для печати.
//
Процедура ЗаполнениеДаннымиДоговоровДляПечати(КоллекцияДанныхДоговоров, ТипХраненияДоговоров, СсылкиВедомостей)
	
	Для Каждого Ведомость Из СсылкиВедомостей Цикл
		КоллекцияДанныхДоговоров.Сбросить();
		
		ТабЗнач = Новый ТаблицаЗначений;
		ТабЗнач.Колонки.Добавить("Договор", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
		ТабЗнач.Колонки.Добавить("Активен", Новый ОписаниеТипов("Булево"));
		ТабЗнач.Колонки.Добавить("НачалоДействия", Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		ТабЗнач.Колонки.Добавить("ОкончаниеДействия", Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
				
		Если ТипХраненияДоговоров.Получить(Ведомость) <> Неопределено Тогда
			ДоговорыДокумента = ТипХраненияДоговоров.Получить(Ведомость);
			
			Пока КоллекцияДанныхДоговоров.Следующий() Цикл
				
				Если ТипЗнч(КоллекцияДанныхДоговоров.ДоговорСсылка) = Тип("СправочникСсылка.Договоры") И ДоговорыДокумента <> Неопределено Тогда
					
					СтрокаСДоговором = ДоговорыДокумента.Найти(КоллекцияДанныхДоговоров.ДоговорСсылка);
					Если Не ПустаяСтрока(СтрокаСДоговором) Тогда
						СтрТабЧасти = ТабЗнач.Добавить();
						ЗаполнитьЗначенияСвойств(СтрТабЧасти, КоллекцияДанныхДоговоров);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ТипХраненияДоговоров.Вставить(Ведомость, ТабЗнач);
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет информацию о дате поздних окончаний договоров для вывода этой информации на печать.
//
// Параметры:
//  ДатыОкончанияДоговоров  - Соответствие - коллекция договоров как ключ и дат окончания как значение, договоров выбранных для печати.
//
// Возвращаемое значение:
//   Структура   - коллекция для строки с самой поздней позицией даты окончания и строки с договорами.
//
Функция ПоздниеОкончанияДоговоров(ДатыОкончанияДоговоров)
	
	Результат = Новый Структура("Договоры, Дата", "ошибка", "ошибка");
	Договоры = Новый Массив;
	Дата = Новый Массив;
	
	Для Каждого Элемент Из ДатыОкончанияДоговоров Цикл
		
		Если Договоры.Количество() = 0 Тогда
			
			Договоры.Добавить(Элемент.Ключ);
			Дата.Добавить(Элемент.Значение);
			
		ИначеЕсли Элемент.Значение = Дата[0] Тогда
			Договоры.Добавить(Элемент.Ключ);
		ИначеЕсли Элемент.Значение > Дата[0] Тогда
			
			Договоры.Очистить();
			Дата.Очистить();
			Договоры.Добавить(Элемент.Ключ);
			Дата.Добавить(Элемент.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Договоры = СтрСоединить(Договоры,", ");
	Результат.Дата = Формат(Дата[0], "ДФ=dd.MM.yyyy;");
	
	Возврат Результат;
	
КонецФункции

// Определяет наибольшее количество договоров среди табличных частей документа.
//
// Параметры:
//  ВсегоДоговоровТабЧасть  - Число - количество договоров из табличной части.
//  ВсегоДоговоровРегистра  - Число - количество договоров из регистра сведений.
//  ВсегоДоговоровХранилища  - Число - количество договоров из хранилища значений.
//  ВсегоДоговоровСтроки  - Число - количество договоров из строки.
//
// Возвращаемое значение:
//   Число   - максимальное количества договоров среди выводимых в печать табличных частей макета табличного документа.
//
Функция МаксимальноеКоличествоДоговоровДокумента(ВсегоДоговоровТабЧасть, ВсегоДоговоровРегистра, ВсегоДоговоровХранилища, ВсегоДоговоровСтроки)

		МассивЧисел = Новый Массив;
		МассивЧисел.Добавить(ВсегоДоговоровТабЧасть);
		МассивЧисел.Добавить(ВсегоДоговоровРегистра);
		МассивЧисел.Добавить(ВсегоДоговоровХранилища);
		МассивЧисел.Добавить(ВсегоДоговоровСтроки);
		
		Результат = МассивЧисел[0];
		Для Индекс = 1 По МассивЧисел.Количество() - 1 Цикл
			
			Если МассивЧисел[Индекс] > Результат Тогда
				Результат = МассивЧисел[Индекс];
			КонецЕсли;
			
		КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Определяет количество активных уникальных договоров документа Ведомость.
//
// Параметры:
//  Коллекция  - Соответствие - все уникальные договоры документа ведомость.
//
// Возвращаемое значение:
//   Число   - количестов активных договоров.
//
Функция КоличествоАктивныхДоговороы(Коллекция)
	
	Счетчик = 0;
	Для каждого Переменная Из Коллекция Цикл
		
		Если Переменная.Значение Тогда
			Счетчик = Счетчик + 1;	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Счетчик; 
	
КонецФункции

// Формирует текстовое поле с информацией и основные настройки письма.
//
// Параметры:
//  Информация  - ТабличныйДокумент - таблица с договорами (представления) из табличной части документа..
//  АдресПочты  - Строка - электронный адрес абонента.
//
// Возвращаемое значение:
//   ИнтернетПочтовоеСообщение  - сформированный текст письма с адресатом получения.
//
Функция ПочтовоеСообщение(Информация, АдресПочты)
	
	АдресФайлаВложения = ПолучитьИмяВременногоФайла(".txt");
	
	Информация.Записать(АдресФайлаВложения, ТипФайлаТабличногоДокумента.HTML);
	
	ТекстHTML = "";
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(АдресФайлаВложения);
	ТекстHTML = ТекстДок.ПолучитьТекст();
	
	ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение;
	ПочтовоеСообщение.Получатели.Добавить(АдресПочты);
	ПочтовоеСообщение.Тема = СтрШаблон("Договоры табличной части от %1", Формат(ТекущаяДата(), "ДЛФ=DD"));
	ПочтовоеСообщение.Важность = ВажностьИнтернетПочтовогоСообщения.Обычная;
	ПочтовоеСообщение.Тексты.Добавить(ТекстHTML, ТипТекстаПочтовогоСообщения.HTML);
		
	Возврат ПочтовоеСообщение;
	
КонецФункции

#КонецОбласти

#КонецЕсли
